enterprise_gcp_blueprint_package/diagrams/plantuml/pipeline_patterns.puml
@startuml
left to right direction
skinparam rectangle {
  BackgroundColor #E8F0FE
  BorderColor #1A73E8
}
  Batch --> Composer --> Dataflow --> DQ --> BQ;
  CDC --> Datastream --> Dataflow --> BQ;
  Stream --> PubSub --> Dataflow --> BQ;
  API --> PubSub;
  BQ --> Dataform --> BQ;
@enduml
